misaka23300/STC15-lanqiao_code/教程/2333/Sources/inc/stc15f_def.h
/**
 * @file stc15f_def.h
 * @brief 未指定描述
 * @date 2026 - 6 - 9
 * @version 1.0
 */

#ifndef __STC15F_DEF_H__
#define __STC15F_DEF_H__

/////////////////////////////////////////////////

#include "stc15.h"
#include "def.h"

/////////////////////////////////////////////////

#define PORT_SetInitLevelLow( p, b )      CLR_REG_BIT( P##p, ( b ))
#define PORT_SetInitLevelHigh( p, b )     SET_REG_BIT( P##p, ( b ))

#define PORT_SetQuasiMode( p, b )         CLR_REG_BIT( P##p##M0, ( b )); \
                                        CLR_REG_BIT( P##p##M1, ( b ))

#define PORT_SetPushPullMode( p, b )      SET_REG_BIT( P##p##M0, ( b )); \
                                        CLR_REG_BIT( P##p##M1, ( b ))

#define PORT_SetHighZInputMode( p, b )    CLR_REG_BIT( P##p##M0, ( b )); \
                                        SET_REG_BIT( P##p##M1, ( b ))

#define PORT_SetOpenDrainMode( p, b )     SET_REG_BIT( P##p##M0, ( b )); \
                                        SET_REG_BIT( P##p##M1, ( b ))

#define PORT_SetAnalogInput( p, b )       SET_REG_BIT( P##p##ASF, ( b ))
#define PORT_SetDigitalInput( p, b )      CLR_REG_BIT( P##p##ASF, ( b ))

#define SetP0nInitLevelLow( b )           PORT_SetInitLevelLow(0, ( b ))
#define SetP1nInitLevelLow( b )           PORT_SetInitLevelLow(1, ( b ))
#define SetP2nInitLevelLow( b )           PORT_SetInitLevelLow(2, ( b ))
#define SetP3nInitLevelLow( b )           PORT_SetInitLevelLow(3, ( b ))
#define SetP4nInitLevelLow( b )           PORT_SetInitLevelLow(4, ( b ))
#define SetP5nInitLevelLow( b )           PORT_SetInitLevelLow(5, ( b ))
#define SetP6nInitLevelLow( b )           PORT_SetInitLevelLow(6, ( b ))
#define SetP7nInitLevelLow( b )           PORT_SetInitLevelLow(7, ( b ))

#define SetP0nInitLevelHigh( b )          PORT_SetInitLevelHigh(0, ( b ))
#define SetP1nInitLevelHigh( b )          PORT_SetInitLevelHigh(1, ( b ))
#define SetP2nInitLevelHigh( b )          PORT_SetInitLevelHigh(2, ( b ))
#define SetP3nInitLevelHigh( b )          PORT_SetInitLevelHigh(3, ( b ))
#define SetP4nInitLevelHigh( b )          PORT_SetInitLevelHigh(4, ( b ))
#define SetP5nInitLevelHigh( b )          PORT_SetInitLevelHigh(5, ( b ))
#define SetP6nInitLevelHigh( b )          PORT_SetInitLevelHigh(6, ( b ))
#define SetP7nInitLevelHigh( b )          PORT_SetInitLevelHigh(7, ( b ))

#define SetP0nQuasiMode( b )              PORT_SetQuasiMode(0, ( b ))
#define SetP1nQuasiMode( b )              PORT_SetQuasiMode(1, ( b ))
#define SetP2nQuasiMode( b )              PORT_SetQuasiMode(2, ( b ))
#define SetP3nQuasiMode( b )              PORT_SetQuasiMode(3, ( b ))
#define SetP4nQuasiMode( b )              PORT_SetQuasiMode(4, ( b ))
#define SetP5nQuasiMode( b )              PORT_SetQuasiMode(5, ( b ))
#define SetP6nQuasiMode( b )              PORT_SetQuasiMode(6, ( b ))
#define SetP7nQuasiMode( b )              PORT_SetQuasiMode(7, ( b ))

#define SetP0nPushPullMode( b )           PORT_SetPushPullMode(0, ( b ))
#define SetP1nPushPullMode( b )           PORT_SetPushPullMode(1, ( b ))
#define SetP2nPushPullMode( b )           PORT_SetPushPullMode(2, ( b ))
#define SetP3nPushPullMode( b )           PORT_SetPushPullMode(3, ( b ))
#define SetP4nPushPullMode( b )           PORT_SetPushPullMode(4, ( b ))
#define SetP5nPushPullMode( b )           PORT_SetPushPullMode(5, ( b ))
#define SetP6nPushPullMode( b )           PORT_SetPushPullMode(6, ( b ))
#define SetP7nPushPullMode( b )           PORT_SetPushPullMode(7, ( b ))

#define SetP0nHighZInputMode( b )         PORT_SetHighZInputMode(0, ( b ))
#define SetP1nHighZInputMode( b )         PORT_SetHighZInputMode(1, ( b ))
#define SetP2nHighZInputMode( b )         PORT_SetHighZInputMode(2, ( b ))
#define SetP3nHighZInputMode( b )         PORT_SetHighZInputMode(3, ( b ))
#define SetP4nHighZInputMode( b )         PORT_SetHighZInputMode(4, ( b ))
#define SetP5nHighZInputMode( b )         PORT_SetHighZInputMode(5, ( b ))
#define SetP6nHighZInputMode( b )         PORT_SetHighZInputMode(6, ( b ))
#define SetP7nHighZInputMode( b )         PORT_SetHighZInputMode(7, ( b ))

#define SetP0nOpenDrainMode( b )          PORT_SetOpenDrainMode(0, ( b ))
#define SetP1nOpenDrainMode( b )          PORT_SetOpenDrainMode(1, ( b ))
#define SetP2nOpenDrainMode( b )          PORT_SetOpenDrainMode(2, ( b ))
#define SetP3nOpenDrainMode( b )          PORT_SetOpenDrainMode(3, ( b ))
#define SetP4nOpenDrainMode( b )          PORT_SetOpenDrainMode(4, ( b ))
#define SetP5nOpenDrainMode( b )          PORT_SetOpenDrainMode(5, ( b ))
#define SetP6nOpenDrainMode( b )          PORT_SetOpenDrainMode(6, ( b ))
#define SetP7nOpenDrainMode( b )          PORT_SetOpenDrainMode(7, ( b ))

#define SetP1nAnalogInput( b )            PORT_SetAnalogInput(1, ( b ))
#define SetP1nDigitalInput( b )           PORT_SetDigitalInput(1, ( b ))

/////////////////////////////////////////////////

#define EnableGlobalInt()               ( EA = 1 )
#define DisableGlobalInt()              ( EA = 0 )

#define INT0_EnableInt()                ( EX0 = 1 )
#define INT0_DisableInt()               ( EX0 = 0 )

#define INT1_EnableInt()                ( EX1 = 1 )
#define INT1_DisableInt()               ( EX1 = 0 )

#define INTCLKO_EX2_MSK                 BIT4
#define INT2_EnableInt()                SET_REG_BIT( INT_CLKO, INTCLKO_EX2_MSK )
#define INT2_DisableInt()               CLR_REG_BIT( INT_CLKO, INTCLKO_EX2_MSK )

#define INTCLKO_EX3_MSK                 BIT5
#define INT3_EnableInt()                SET_REG_BIT( INT_CLKO, INTCLKO_EX3_MSK )
#define INT3_DisableInt()               CLR_REG_BIT( INT_CLKO, INTCLKO_EX3_MSK )

#define INTCLKO_EX4_MSK                 BIT6
#define INT4_EnableInt()                SET_REG_BIT( INT_CLKO, INTCLKO_EX4_MSK )
#define INT4_DisableInt()               CLR_REG_BIT( INT_CLKO, INTCLKO_EX4_MSK )

#define TIMER0_EnableInt()              ( ET0 = 1 )
#define TIMER0_DisableInt()             ( ET0 = 0 )

#define TIMER1_EnableInt()              ( ET1 = 1 )
#define TIMER1_DisableInt()             ( ET1 = 0 )

#define IE2_ET2_MSK                     BIT2
#define TIMER2_EnableInt()              SET_REG_BIT( IE2, IE2_ET2_MSK )
#define TIMER2_DisableInt()             CLR_REG_BIT( IE2, IE2_ET2_MSK )

#define UART1_EnableInt()               ( ES = 1 )
#define UART1_DisableInt()              ( ES = 0 )

