misaka23300/STC15-lanqiao_code/教程/2333/Sources/inc/stc15f_def.h
#define IE2_ES2_MSK                     BIT0
#define UART2_EnableInt()               SET_REG_BIT( IE2, IE2_ES2_MSK )
#define UART2_DisableInt()              CLR_REG_BIT( IE2, IE2_ES2_MSK )

#define LVD_EnableInt()                 ( ELVD = 1 )
#define LVD_DisableInt()                ( ELVD = 0 )

#define ADC_EnableInt()                 ( EADC = 1 )
#define ADC_DisableInt()                ( EADC = 0 )

#define IE2_ESPI_MSK                    BIT1
#define SPI_EnableInt()                 SET_REG_BIT( IE2, IE2_ESPI_MSK )
#define SPI_DisableInt()                CLR_REG_BIT( IE2, IE2_ESPI_MSK )

#define CMOD_ECF_MSK                    BIT0
#define PCA_EnableCounterInt()          SET_REG_BIT( CMOD, CMOD_ECF_MSK )
#define PCA_DisableCounterInt()         CLR_REG_BIT( CMOD, CMOD_ECF_MSK )

#define CCAPM0_ECCF0_MSK                BIT0
#define CCAPM1_ECCF1_MSK                BIT0
#define CCAPM2_ECCF2_MSK                BIT0
#define PCA_EnableCCF0Int()             SET_REG_BIT( CCAPM0, CCAPM0_ECCF0_MSK )
#define PCA_EnableCCF1Int()             SET_REG_BIT( CCAPM1, CCAPM1_ECCF1_MSK )
#define PCA_EnableCCF2Int()             SET_REG_BIT( CCAPM2, CCAPM2_ECCF2_MSK )
#define PCA_DisableCCF0Int()            CLR_REG_BIT( CCAPM0, CCAPM0_ECCF0_MSK )
#define PCA_DisableCCF1Int()            CLR_REG_BIT( CCAPM1, CCAPM1_ECCF1_MSK )
#define PCA_DisableCCF2Int()            CLR_REG_BIT( CCAPM2, CCAPM2_ECCF2_MSK )

#define INT0_FallingRisingInt()         ( IT0 = 0 )
#define INT0_FallingInt()               ( IT0 = 1 )

#define INT0_CheckFlag()                ( IE0 )
#define INT0_ClearFlag()                ( IE0 = 0 )

#define INT1_FallingRisingInt()         ( IT1 = 0 )
#define INT1_FallingInt()               ( IT1 = 1 )

#define INT1_CheckFlag()                ( IE1 )
#define INT1_ClearFlag()                ( IE1 = 0 )

#define TIMER0_CheckFlag()              ( TF0 )
#define TIMER0_ClearFlag()              ( TF0 = 0 )

#define TIMER1_CheckFlag()              ( TF1 )
#define TIMER1_ClearFlag()              ( TF1 = 0 )

#define UART1_CheckRxFlag()             ( RI )
#define UART1_CheckTxFlag()             ( TI )
#define UART1_ClearRxFlag()             ( RI = 0 )
#define UART1_ClearTxFlag()             ( TI = 0 )
#define UART1_SetRxFlag()               ( RI = 1 )
#define UART1_SetTxFlag()               ( TI = 1 )

#define S2CON_S2TI_MSK                  BIT1
#define S2CON_S2RI_MSK                  BIT0
#define UART2_CheckRxFlag()             READ_REG_BIT( S2CON, S2CON_S2RI_MSK )
#define UART2_CheckTxFlag()             READ_REG_BIT( S2CON, S2CON_S2TI_MSK )
#define UART2_ClearRxFlag()             CLR_REG_BIT( S2CON, S2CON_S2RI_MSK )
#define UART2_ClearTxFlag()             CLR_REG_BIT( S2CON, S2CON_S2TI_MSK )
#define UART2_SetRxFlag()               SET_REG_BIT( S2CON, S2CON_S2RI_MSK )
#define UART2_SetTxFlag()               SET_REG_BIT( S2CON, S2CON_S2TI_MSK )

#define PCON_LVDF_MSK                   BIT5
#define LVD_CheckFlag()                 READ_REG_BIT( PCON, PCON_LVDF_MSK )
#define LVD_ClearFlag()                 CLR_REG_BIT( PCON, PCON_LVDF_MSK )

#define ADCCONTR_ADCFLAG_MSK            BIT4
#define ADC_CheckFlag()                 READ_REG_BIT( ADC_CONTR, ADCCONTR_ADCFLAG_MSK )
#define ADC_ClearFlag()                 CLR_REG_BIT( ADC_CONTR, ADCCONTR_ADCFLAG_MSK )

#define SPSTAT_SPIF_MSK                 BIT7
#define SPSTAT_WCOL_MSK                 BIT6
#define SPI_CheckFlag()                 READ_REG_BIT( SPSTAT, SPSTAT_SPIF_MSK )
#define SPI_ClearFlag()                 SET_REG_BIT( SPSTAT, SPSTAT_SPIF_MSK | SPSTAT_WCOL_MSK )

#define CCON_CF_MSK                     BIT7
#define PCA_CheckCounterFlag()          READ_REG_BIT( CCON, CCON_CF_MSK )
#define PCA_ClearCounterFlag()          CLR_REG_BIT( CCON, CCON_CF_MSK )

#define CCON_CCF0_MSK                   BIT0
#define CCON_CCF1_MSK                   BIT1
#define CCON_CCF2_MSK                   BIT2
#define PCA_CheckCCF0Flag()             READ_REG_BIT( CCON, CCON_CCF0_MSK )
#define PCA_CheckCCF1Flag()             READ_REG_BIT( CCON, CCON_CCF1_MSK )
#define PCA_CheckCCF2Flag()             READ_REG_BIT( CCON, CCON_CCF2_MSK )
#define PCA_ClearCCF0Flag()             CLR_REG_BIT( CCON, CCON_CCF0_MSK )
#define PCA_ClearCCF1Flag()             CLR_REG_BIT( CCON, CCON_CCF1_MSK )
#define PCA_ClearCCF2Flag()             CLR_REG_BIT( CCON, CCON_CCF2_MSK )

#define INT0_SetIntPriority( n )          PX0 = (( n ) & 1 )

#define INT1_SetIntPriority( n )          PX1 = (( n ) & 1 )

#define IP2_PX4_MSK                     BIT4
#define INT4_SetIntPriority( n )          MODIFY_REG( IP2, IP2_PX4_MSK, ((( n ) & 1 ) << 4 ))

#define TIMER0_SetIntPriority( n )        PT0 = (( n ) & 1 )

#define TIMER1_SetIntPriority( n )        PT1 = (( n ) & 1 )

#define UART1_SetIntPriority( n )         PS = (( n ) & 1 )

#define IP2_PS2_MSK                     BIT0
#define UART2_SetIntPriority( n )         MODIFY_REG( IP2, IP2_PS2_MSK, ((( n ) & 1 ) << 0 ))

#define LVD_SetIntPriority( n )           PLVD = (( n ) & 1 )

#define ADC_SetIntPriority( n )           PADC = (( n ) & 1 )

#define IP2_PSPI_MSK                    BIT1
#define SPI_SetIntPriority( n )           MODIFY_REG( IP2, IP2_PSPI_MSK, ((( n ) & 1 ) << 1 ))

#define PCA_SetIntPriority( n )           PPCA = (( n ) & 1 )

/////////////////////////////////////////////////

#define EAXFR_MSK                       BIT7
#define EnableAccessXFR()               SET_REG_BIT( P_SW2, EAXFR_MSK )

#define UART1_PS_MSK                    ( BIT7 | BIT6 )
#define UART1_SwitchP3031()             MODIFY_REG( P_SW1, UART1_PS_MSK, ((0 ) << 6 ))
#define UART1_SwitchP3637()             MODIFY_REG( P_SW1, UART1_PS_MSK, ((1 ) << 6 ))
#define UART1_SwitchP1617()             MODIFY_REG( P_SW1, UART1_PS_MSK, ((2 ) << 6 ))

#define UART2_PS_MSK                    ( BIT0 )
#define UART2_SwitchP1011()             CLR_REG_BIT( P_SW2, UART2_PS_MSK )
#define UART2_SwitchP4647()             SET_REG_BIT( P_SW2, UART2_PS_MSK )

#define SPI_PS_MSK                      ( BIT3 | BIT2 )
#define SPI_SwitchP1n()                 MODIFY_REG( P_SW1, SPI_PS_MSK, ((0 ) << 2 ))
#define SPI_SwitchP2n()                 MODIFY_REG( P_SW1, SPI_PS_MSK, ((1 ) << 2 ))
#define SPI_SwitchP4n()                 MODIFY_REG( P_SW1, SPI_PS_MSK, ((2 ) << 2 ))

#define MCLKO_PS_MSK                    ( BIT3 )
#define CLK_SYSCLKO_SwitchP54()         CLR_REG_BIT( CLK_DIV, MCLKO_PS_MSK )
#define CLK_SYSCLKO_SwitchP16()         SET_REG_BIT( CLK_DIV, MCLKO_PS_MSK )

