misaka23300/STC15-lanqiao_code/教程/2333/Sources/inc/stc15f_def.h
#define PCA_PS_MSK                      ( BIT5 | BIT4 )
#define PCA_SwitchP1n()                 MODIFY_REG( P_SW1, PCA_PS_MSK, ((0 ) << 4 ))
#define PCA_SwitchP3n()                 MODIFY_REG( P_SW1, PCA_PS_MSK, ((1 ) << 4 ))
#define PCA_SwitchP2n()                 MODIFY_REG( P_SW1, PCA_PS_MSK, ((2 ) << 4 ))

/////////////////////////////////////////////////

#define MCLKODIV_MSK                    ( BIT7 | BIT6 )
#define CLK_SYSCLKO_Divider( n )          MODIFY_REG( CLK_DIV, MCLKODIV_MSK, (( n ) << 6 ))
#define CLK_SYSCLKO_Divider1()			CLK_SYSCLKO_Divider(1 )
#define CLK_SYSCLKO_Divider2()			CLK_SYSCLKO_Divider(2 )
#define CLK_SYSCLKO_Divider4()			CLK_SYSCLKO_Divider(3 )

/////////////////////////////////////////////////

#define WDTCONTR_FLAG_MSK               BIT7
#define WDTCONTR_EN_MSK                 BIT5
#define WDTCONTR_CLR_MSK                BIT4
#define WDTCONTR_IDL_MSK                BIT3
#define WDTCONTR_PS_MSK                 ( BIT2 | BIT1 | BIT0 )

#define WDT_Enable()                    SET_REG_BIT( WDT_CONTR, WDTCONTR_EN_MSK )
#define WDT_Clear()                     SET_REG_BIT( WDT_CONTR, WDTCONTR_CLR_MSK )
#define WDT_CheckWDTReset()             READ_REG_BIT( WDT_CONTR, WDTCONTR_FLAG_MSK )
#define WDT_IdlePause()                 CLR_REG_BIT( WDT_CONTR, WDTCONTR_IDL_MSK )
#define WDT_IdleContinue()              SET_REG_BIT( WDT_CONTR, WDTCONTR_IDL_MSK )

#define WDT_SetPrescale( n )              MODIFY_REG( WDT_CONTR, WDTCONTR_PS_MSK, (( n ) << 0 ))
#define WDT_SetPrescale2()              WDT_SetPrescale(0 )
#define WDT_SetPrescale4()              WDT_SetPrescale(1 )
#define WDT_SetPrescale8()              WDT_SetPrescale(2 )
#define WDT_SetPrescale16()             WDT_SetPrescale(3 )
#define WDT_SetPrescale32()             WDT_SetPrescale(4 )
#define WDT_SetPrescale64()             WDT_SetPrescale(5 )
#define WDT_SetPrescale128()            WDT_SetPrescale(6 )
#define WDT_SetPrescale256()            WDT_SetPrescale(7 )

/////////////////////////////////////////////////

#define TIMER0_Run()                    ( TR0 = 1 )
#define TIMER0_Stop()                   ( TR0 = 0 )

#define TIMER0_SetReload8( n )            ( TH0 = LOBYTE( n ), TL0 = LOBYTE( n ))
#define TIMER0_SetReload16( n )           ( TH0 = HIBYTE( n ), TL0 = LOBYTE( n ))

#define TMOD_T0M_MSK                    ( BIT1 | BIT0 )
#define TIMER0_Mode0()                  MODIFY_REG( TMOD, TMOD_T0M_MSK, ((0 ) << 0 ))
#define TIMER0_Mode1()                  MODIFY_REG( TMOD, TMOD_T0M_MSK, ((1 ) << 0 ))
#define TIMER0_Mode2()                  MODIFY_REG( TMOD, TMOD_T0M_MSK, ((2 ) << 0 ))
#define TIMER0_Mode3()                  MODIFY_REG( TMOD, TMOD_T0M_MSK, ((3 ) << 0 ))

#define AUXR_T0X12_MSK                  BIT7
#define TIMER0_1TMode()                 SET_REG_BIT( AUXR, AUXR_T0X12_MSK )
#define TIMER0_12TMode()                CLR_REG_BIT( AUXR, AUXR_T0X12_MSK )

#define TMOD_T0CT_MSK                   BIT2
#define TIMER0_TimerMode()              CLR_REG_BIT( TMOD, TMOD_T0CT_MSK )
#define TIMER0_CounterMode()            SET_REG_BIT( TMOD, TMOD_T0CT_MSK )

#define TMOD_T0GATE_MSK                 BIT3
#define TIMER0_EnableGateINT0()         SET_REG_BIT( TMOD, TMOD_T0GATE_MSK )
#define TIMER0_DisableGateINT0()        CLR_REG_BIT( TMOD, TMOD_T0GATE_MSK )

#define INTCLKO_T0CLKO_MSK              BIT0
#define TIMER0_EnableCLKO()             SET_REG_BIT( INT_CLKO, INTCLKO_T0CLKO_MSK )
#define TIMER0_DisableCLKO()            CLR_REG_BIT( INT_CLKO, INTCLKO_T0CLKO_MSK )

////////////////////////

#define TIMER1_Run()                    ( TR1 = 1 )
#define TIMER1_Stop()                   ( TR1 = 0 )

#define TIMER1_SetReload8( n )            ( TH1 = LOBYTE( n ), TL1 = LOBYTE( n ))
#define TIMER1_SetReload16( n )           ( TH1 = HIBYTE( n ), TL1 = LOBYTE( n ))

#define TMOD_T1M_MSK                    ( BIT5 | BIT4 )
#define TIMER1_Mode0()                  MODIFY_REG( TMOD, TMOD_T1M_MSK, ((0 ) << 4 ))
#define TIMER1_Mode1()                  MODIFY_REG( TMOD, TMOD_T1M_MSK, ((1 ) << 4 ))
#define TIMER1_Mode2()                  MODIFY_REG( TMOD, TMOD_T1M_MSK, ((2 ) << 4 ))

#define AUXR_T1X12_MSK                  BIT6
#define TIMER1_1TMode()                 SET_REG_BIT( AUXR, AUXR_T1X12_MSK )
#define TIMER1_12TMode()                CLR_REG_BIT( AUXR, AUXR_T1X12_MSK )

#define TMOD_T1CT_MSK                   BIT6
#define TIMER1_TimerMode()              CLR_REG_BIT( TMOD, TMOD_T1CT_MSK )
#define TIMER1_CounterMode()            SET_REG_BIT( TMOD, TMOD_T1CT_MSK )

#define TMOD_T1GATE_MSK                 BIT7
#define TIMER1_EnableGateINT1()         SET_REG_BIT( TMOD, TMOD_T1GATE_MSK )
#define TIMER1_DisableGateINT1()        CLR_REG_BIT( TMOD, TMOD_T1GATE_MSK )

#define INTCLKO_T1CLKO_MSK              BIT1
#define TIMER1_EnableCLKO()             SET_REG_BIT( INT_CLKO, INTCLKO_T1CLKO_MSK )
#define TIMER1_DisableCLKO()            CLR_REG_BIT( INT_CLKO, INTCLKO_T1CLKO_MSK )

////////////////////////

#define AUXR_T2R_MSK                    BIT4
#define TIMER2_Run()                    SET_REG_BIT( AUXR, AUXR_T2R_MSK )
#define TIMER2_Stop()                   CLR_REG_BIT( AUXR, AUXR_T2R_MSK )

#define TIMER2_SetReload16( n )           ( T2H = HIBYTE( n ), T2L = LOBYTE( n ))

#define AUXR_T2X12_MSK                  BIT2
#define TIMER2_1TMode()                 SET_REG_BIT( AUXR, AUXR_T2X12_MSK )
#define TIMER2_12TMode()                CLR_REG_BIT( AUXR, AUXR_T2X12_MSK )

#define AUXR_T2CT_MSK                   BIT3
#define TIMER2_TimerMode()              CLR_REG_BIT( AUXR, AUXR_T2CT_MSK )
#define TIMER2_CounterMode()            SET_REG_BIT( AUXR, AUXR_T2CT_MSK )

#define INTCLKO_T2CLKO_MSK              BIT2
#define TIMER2_EnableCLKO()             SET_REG_BIT( INT_CLKO, INTCLKO_T2CLKO_MSK )
#define TIMER2_DisableCLKO()            CLR_REG_BIT( INT_CLKO, INTCLKO_T2CLKO_MSK )

/////////////////////////////////////////////////

#define SCON_SM_MSK                     ( BIT7 | BIT6 )
#define UART1_SetMode( n )                MODIFY_REG( SCON, SCON_SM_MSK, (( n ) << 6 ))
#define UART1_Mode0()                   UART1_SetMode(0 )
#define UART1_Mode1()                   UART1_SetMode(1 )
#define UART1_Mode2()                   UART1_SetMode(2 )
#define UART1_Mode3()                   UART1_SetMode(3 )

#define UART1_EnableRx()                ( REN = 1 )
#define UART1_DisableRx()               ( REN = 0 )
#define UART1_SetTB8( b )                 ( TB8 = ( b ))
#define UART1_ReadRB8()                 ( RB8 )

#define UART1_SendData( d )               ( SBUF = ( d ))
#define UART1_ReadData()                ( SBUF )

#define PCON_SMOD_MSK                   BIT7
#define UART1_BaudrateX2()              SET_REG_BIT( PCON, PCON_SMOD_MSK )

