misaka23300/STC15-lanqiao_code/教程/2333/Sources/inc/stc15f_def.h
#define AUXR_M0X6_MSK                   BIT5
#define UART1_Mode0BaudrateX6()         SET_REG_BIT( AUXR, AUXR_M0X6_MSK )

#define AUXR_S1BRT_MSK                  BIT0
#define UART1_Timer1BRT()               CLR_REG_BIT( AUXR, AUXR_S1BRT_MSK )
#define UART1_Timer2BRT()               SET_REG_BIT( AUXR, AUXR_S1BRT_MSK )

////////////////////////

#define S2CON_S2SM_MSK                  BIT7
#define UART2_SetMode( n )                MODIFY_REG( S2CON, S2CON_S2SM_MSK, (( n ) << 7 ))
#define UART2_Mode0()                   CLR_REG_BIT( S2CON, S2CON_S2SM_MSK )
#define UART2_Mode1()                   SET_REG_BIT( S2CON, S2CON_S2SM_MSK )

#define S2CON_S2REN_MSK                 BIT4
#define UART2_EnableRx()                SET_REG_BIT( S2CON, S2CON_S2REN_MSK )
#define UART2_DisableRx()               CLR_REG_BIT( S2CON, S2CON_S2REN_MSK )

#define S2CON_S2TB8_MSK                 BIT3
#define UART2_SetTB8( b )                 MODIFY_REG( S2CON, S2CON_S2TB8_MSK, (( b ) << 3 ))

#define S2CON_S2RB8_MSK                 BIT2
#define UART2_ReadRB8()                 READ_REG_BIT( S2CON, S2CON_S2RB8_MSK )

#define UART2_SendData( d )               ( S2BUF = ( d ))
#define UART2_ReadData()                ( S2BUF )

/////////////////////////////////////////////////

#define IAPCON_IAPEN_MSK                BIT7
#define IAP_Enable()                    SET_REG_BIT( IAP_CONTR, IAPCON_IAPEN_MSK )
#define IAP_Disable()                   CLR_REG_BIT( IAP_CONTR, IAPCON_IAPEN_MSK )

#define IAP_SetData( d )                  ( IAP_DATA = ( d ))
#define IAP_ReadData()                  ( IAP_DATA )

#define IAP_SetAddress( n )               IAP_ADDRL = BYTE0( n ); \
                                        IAP_ADDRH = BYTE1( n )

#define IAP_Trigger()                   IAP_TRIG = 0x5a; \
                                        IAP_TRIG = 0xa5; \
                                        _nop_();         \
                                        _nop_();         \
                                        _nop_();         \
                                        _nop_()

#define IAP_Idle()                      IAP_CMD = 0
#define IAP_TriggerRead()               IAP_CMD = 1; IAP_Trigger()
#define IAP_TriggerProgram()            IAP_CMD = 2; IAP_Trigger()
#define IAP_TriggerErase()              IAP_CMD = 3; IAP_Trigger()

#define IAPCON_WT_MSK                  	( BIT2 | BIT1 | BIT0 )
#define IAP_SetWaitTime( n )              MODIFY_REG( IAP_CONTR, IAPCON_WT_MSK, (( n ) << 0 ))
#define IAP_SetTimeBase()               IAP_SetWaitTime(( SYSCLK ) <=  1000000 ? 7 : \
                                                        ( SYSCLK ) <=  2000000 ? 6 : \
                                                        ( SYSCLK ) <=  3000000 ? 5 : \
                                                        ( SYSCLK ) <=  6000000 ? 4 : \
                                                        ( SYSCLK ) <= 12000000 ? 3 : \
                                                        ( SYSCLK ) <= 20000000 ? 2 : \
                                                        ( SYSCLK ) <= 24000000 ? 1 : 0 )

#define IAPCON_FAIL_MSK                 BIT4
#define IAP_CheckErrorFlag()            READ_REG_BIT( IAP_CONTR, IAPCON_FAIL_MSK )
#define IAP_ClearErrorFlag()            CLR_REG_BIT( IAP_CONTR, IAPCON_FAIL_MSK )

/////////////////////////////////////////////////

#define ADCCONTR_ADCPOWER_MSK           BIT7
#define ADC_Enable()                    SET_REG_BIT( ADC_CONTR, ADCCONTR_ADCPOWER_MSK )
#define ADC_Disable()                   CLR_REG_BIT( ADC_CONTR, ADCCONTR_ADCPOWER_MSK )

#define ADC_ReadResult()                MAKEWORD( ADC_RESL, ADC_RES )

#define ADCCONTR_ADCSTART_MSK           BIT3
#define ADC_Start()                     SET_REG_BIT( ADC_CONTR, ADCCONTR_ADCSTART_MSK )

#define ADCCONTR_ADCCHS_MSK             ( BIT2 | BIT1 | BIT0 )
#define ADC_ActiveChannel( n )            MODIFY_REG( ADC_CONTR, ADCCONTR_ADCCHS_MSK, (( n ) << 0 ))

#define PWMCFG_CBTADC_MSK               BIT6
#define ADC_EnablePWMTrig()             SET_REG_BIT( PWMCFG, PWMCFG_CBTADC_MSK )

#define CLKDIV_ADRJ_MSK                 BIT5
#define ADC_ResultLeftAlign()           CLR_REG_BIT( CLK_DIV, CLKDIV_ADRJ_MSK )
#define ADC_ResultRightAlign()          SET_REG_BIT( CLK_DIV, CLKDIV_ADRJ_MSK )

#define ADCCONTR_SPEED_MSK              ( BIT6 | BIT5 )
#define ADC_SetClockDivider( n )          MODIFY_REG( ADC_CONTR, ADCCONTR_SPEED_MSK, (( n ) << 5 ))
#define ADC_SetSpeedTo90Clocks()        ADC_SetClockDivider(3 )
#define ADC_SetSpeedTo180Clocks()       ADC_SetClockDivider(2 )
#define ADC_SetSpeedTo360Clocks()       ADC_SetClockDivider(1 )
#define ADC_SetSpeedTo540Clocks()       ADC_SetClockDivider(0 )

/////////////////////////////////////////////////

#define CCON_CR_MSK                     BIT6
#define PCA_Run()                       SET_REG_BIT( CCON, CCON_CR_MSK )
#define PCA_Stop()                      CLR_REG_BIT( CCON, CCON_CR_MSK )

#define CMOD_CIDL_MSK                   BIT7
#define PCA_IdlePause()                 SET_REG_BIT( CMOD, CMOD_CIDL_MSK )
#define PCA_IdleContinue()              CLR_REG_BIT( CMOD, CMOD_CIDL_MSK )

#define CMOD_CPS_MSK                    ( BIT3 |BIT2 |BIT1 )
#define PCA_SetClockSource( n )           MODIFY_REG( CMOD, CMOD_CPS_MSK, (( n ) << 1 ))
#define PCA_CLK_SYSCLKD12()             PCA_SetClockSource(0 )
#define PCA_CLK_SYSCLKD2()              PCA_SetClockSource(1 )
#define PCA_CLK_TIMER0OV()              PCA_SetClockSource(2 )
#define PCA_CLK_ECI()                   PCA_SetClockSource(3 )
#define PCA_CLK_SYSCLK()                PCA_SetClockSource(4 )
#define PCA_CLK_SYSCLKD4()              PCA_SetClockSource(5 )
#define PCA_CLK_SYSCLKD6()              PCA_SetClockSource(6 )
#define PCA_CLK_SYSCLKD8()              PCA_SetClockSource(7 )

#define PCA_SetCounter( n )               ( CH = HIBYTE( n ), CL = LOBYTE( n ))
#define PCA_InitCounter()               PCA_SetCounter(0 )

#define PCA_SetCnReload( n, v )           CCAP##n##L = LOBYTE( v ); \
                                        CCAP##n##H = LOBYTE( v )

#define PCA_SetCnMatch( n, v )            ( CCAP##n##L = LOBYTE( v ), CCAP##n##H = HIBYTE( v ))

