misaka23300/STC15-lanqiao_code/教程/2333/Sources/inc/stc15f_def.h
#define PCA_ReadCnCapture( n )            MAKEWORD( CCAP##n##L, CCAP##n##H )

#define CCAPMn_ECOM_MSK                 BIT6
#define CCAPMn_CCAPP_MSK                BIT5
#define CCAPMn_CCAPN_MSK                BIT4
#define CCAPMn_MAT_MSK                  BIT3
#define CCAPMn_TOG_MSK                  BIT2
#define CCAPMn_PWM_MSK                  BIT1
#define PCAPWMn_EBS_MSK                 ( BIT7 | BIT6 )

#define PCA_DisableCn( n )    			CCAPM##n = 0

#define PCA_SetCnAs6BitPWMMode( n )       CCAPM##n = ( CCAPMn_ECOM_MSK | CCAPMn_PWM_MSK ); \
                                        MODIFY_REG( PCA_PWM##n, PCAPWMn_EBS_MSK, ((2 ) << 6 ))
#define PCA_SetCnAs7BitPWMMode( n )       CCAPM##n = ( CCAPMn_ECOM_MSK | CCAPMn_PWM_MSK ); \
                                        MODIFY_REG( PCA_PWM##n, PCAPWMn_EBS_MSK, ((1 ) << 6 ))
#define PCA_SetCnAs8BitPWMMode( n )       CCAPM##n = ( CCAPMn_ECOM_MSK | CCAPMn_PWM_MSK ); \
                                        MODIFY_REG( PCA_PWM##n, PCAPWMn_EBS_MSK, ((0 ) << 6 ))

#define PCA_EnableCnCapturePWMPos( n )    MODIFY_REG( CCAPM##n, CCAPMn_CCAPP_MSK | CCAPMn_CCAPN_MSK, ( CCAPMn_CCAPP_MSK ))
#define PCA_EnableCnCapturePWMNeg( n )    MODIFY_REG( CCAPM##n, CCAPMn_CCAPP_MSK | CCAPMn_CCAPN_MSK, ( CCAPMn_CCAPN_MSK ))
#define PCA_EnableCnCapturePWMEdge( n )   CCAPM##n |= ( CCAPMn_CCAPP_MSK | CCAPMn_CCAPN_MSK )

#define PCA_SetCnAsCapturePosMode( n )    CCAPM##n = ( CCAPMn_CCAPP_MSK )
#define PCA_SetCnAsCaptureNegMode( n )    CCAPM##n = ( CCAPMn_CCAPN_MSK )
#define PCA_SetCnAsCaptureEdgeMode( n )   CCAPM##n = ( CCAPMn_CCAPP_MSK | CCAPMn_CCAPN_MSK )

#define PCA_SetCnAs16BitTimerMode( n )    CCAPM##n = ( CCAPMn_ECOM_MSK | CCAPMn_MAT_MSK )

#define PCA_SetCnAsHighSpeedPulseMode( n ) CCAPM##n = ( CCAPMn_ECOM_MSK | CCAPMn_MAT_MSK | CCAPMn_TOG_MSK )

#define PCA_DisableC0()              	PCA_DisableCn(0 )
#define PCA_DisableC1()              	PCA_DisableCn(1 )
#define PCA_DisableC2()              	PCA_DisableCn(2 )

#define PCA_SetC0Reload( v )              PCA_SetCnReload(0, ( v ))
#define PCA_SetC1Reload( v )              PCA_SetCnReload(1, ( v ))
#define PCA_SetC2Reload( v )              PCA_SetCnReload(2, ( v ))

#define PCA_SetC0Match( v )               PCA_SetCnMatch(0, ( v ))
#define PCA_SetC1Match( v )               PCA_SetCnMatch(1, ( v ))
#define PCA_SetC2Match( v )               PCA_SetCnMatch(2, ( v ))

#define PCA_ReadC0Capture()             PCA_ReadCnCapture(0 )
#define PCA_ReadC1Capture()             PCA_ReadCnCapture(1 )
#define PCA_ReadC2Capture()             PCA_ReadCnCapture(2 )

#define PCA_SetC0As6BitPWMMode()        PCA_SetCnAs6BitPWMMode(0 )
#define PCA_SetC1As6BitPWMMode()        PCA_SetCnAs6BitPWMMode(1 )
#define PCA_SetC2As6BitPWMMode()        PCA_SetCnAs6BitPWMMode(2 )

#define PCA_SetC0As7BitPWMMode()        PCA_SetCnAs7BitPWMMode(0 )
#define PCA_SetC1As7BitPWMMode()        PCA_SetCnAs7BitPWMMode(1 )
#define PCA_SetC2As7BitPWMMode()        PCA_SetCnAs7BitPWMMode(2 )

#define PCA_SetC0As8BitPWMMode()        PCA_SetCnAs8BitPWMMode(0 )
#define PCA_SetC1As8BitPWMMode()        PCA_SetCnAs8BitPWMMode(1 )
#define PCA_SetC2As8BitPWMMode()        PCA_SetCnAs8BitPWMMode(2 )

#define PCA_EnableC0CapturePWMPos()     PCA_EnableCnCapturePWMPos(0 )
#define PCA_EnableC1CapturePWMPos()     PCA_EnableCnCapturePWMPos(1 )
#define PCA_EnableC2CapturePWMPos()     PCA_EnableCnCapturePWMPos(2 )

#define PCA_EnableC0CapturePWMNeg()     PCA_EnableCnCapturePWMNeg(0 )
#define PCA_EnableC1CapturePWMNeg()     PCA_EnableCnCapturePWMNeg(1 )
#define PCA_EnableC2CapturePWMNeg()     PCA_EnableCnCapturePWMNeg(2 )

#define PCA_EnableC0CapturePWMEdge()    PCA_EnableCnCapturePWMEdge(0 )
#define PCA_EnableC1CapturePWMEdge()    PCA_EnableCnCapturePWMEdge(1 )
#define PCA_EnableC2CapturePWMEdge()    PCA_EnableCnCapturePWMEdge(2 )

#define PCA_SetC0AsCapturePosMode()     PCA_SetCnAsCapturePosMode(0 )
#define PCA_SetC1AsCapturePosMode()     PCA_SetCnAsCapturePosMode(1 )
#define PCA_SetC2AsCapturePosMode()     PCA_SetCnAsCapturePosMode(2 )

#define PCA_SetC0AsCaptureNegMode()     PCA_SetCnAsCaptureNegMode(0 )
#define PCA_SetC1AsCaptureNegMode()     PCA_SetCnAsCaptureNegMode(1 )
#define PCA_SetC2AsCaptureNegMode()     PCA_SetCnAsCaptureNegMode(2 )

#define PCA_SetC0AsCaptureEdgeMode()    PCA_SetCnAsCaptureEdgeMode(0 )
#define PCA_SetC1AsCaptureEdgeMode()    PCA_SetCnAsCaptureEdgeMode(1 )
#define PCA_SetC2AsCaptureEdgeMode()    PCA_SetCnAsCaptureEdgeMode(2 )

#define PCA_SetC0As16BitTimerMode()     PCA_SetCnAs16BitTimerMode(0 )
#define PCA_SetC1As16BitTimerMode()     PCA_SetCnAs16BitTimerMode(1 )
#define PCA_SetC2As16BitTimerMode()     PCA_SetCnAs16BitTimerMode(2 )

#define PCA_SetC0AsHighSpeedPulseMode() PCA_SetCnAsHighSpeedPulseMode(0 )
#define PCA_SetC1AsHighSpeedPulseMode() PCA_SetCnAsHighSpeedPulseMode(1 )
#define PCA_SetC2AsHighSpeedPulseMode() PCA_SetCnAsHighSpeedPulseMode(2 )

/////////////////////////////////////////////////

#define SPCTL_SPEN_MSK                  BIT6
#define SPI_Enable()                    SET_REG_BIT( SPCTL, SPCTL_SPEN_MSK )
#define SPI_Disable()                   CLR_REG_BIT( SPCTL, SPCTL_SPEN_MSK )

#define SPCTL_DORD_MSK                  BIT5
#define SPI_DataLSB()                   SET_REG_BIT( SPCTL, SPCTL_DORD_MSK )
#define SPI_DataMSB()                   CLR_REG_BIT( SPCTL, SPCTL_DORD_MSK )

#define SPCTL_MSTR_MSK                  BIT4
#define SPI_MasterMode()                SET_REG_BIT( SPCTL, SPCTL_MSTR_MSK )
#define SPI_SlaveMode()                 CLR_REG_BIT( SPCTL, SPCTL_MSTR_MSK )

#define SPCTL_SSIG_MSK                  BIT7
#define SPI_IgnoreSS()                  SET_REG_BIT( SPCTL, SPCTL_SSIG_MSK )
#define SPI_UnignoreSS()                CLR_REG_BIT( SPCTL, SPCTL_SSIG_MSK )

#define SPCTL_CPOL_MSK                  BIT3
#define SPCTL_CPHA_MSK                  BIT2
#define SPIMODE                         ( SPCTL_CPOL_MSK | SPCTL_CPHA_MSK )
#define SPI_SetMode0()                  MODIFY_REG( SPCTL, SPIMODE, ((0 ) << 2 ))
#define SPI_SetMode1()                  MODIFY_REG( SPCTL, SPIMODE, ((1 ) << 2 ))
#define SPI_SetMode2()                  MODIFY_REG( SPCTL, SPIMODE, ((2 ) << 2 ))
#define SPI_SetMode3()                  MODIFY_REG( SPCTL, SPIMODE, ((3 ) << 2 ))

#define SPCTL_SPR_MSK                   ( BIT1 | BIT0 )
#define SPI_SetClockDivider( n )          MODIFY_REG( SPCTL, SPCTL_SPR_MSK, (( n ) << 0 ))
#define SPI_SetClockDivider4()          SPI_SetClockDivider(0 )
#define SPI_SetClockDivider16()         SPI_SetClockDivider(1 )
#define SPI_SetClockDivider64()         SPI_SetClockDivider(2 )
#define SPI_SetClockDivider128()        SPI_SetClockDivider(3 )

#define SPI_SendData( d )                 ( SPDAT = ( d ))
#define SPI_ReadData()                  ( SPDAT )

/////////////////////////////////////////////////
//Interrupt Vector
/////////////////////////////////////////////////

#define     INT0_VECTOR             0       //0003H
#define     TMR0_VECTOR             1       //000BH
#define     INT1_VECTOR             2       //0013H
#define     TMR1_VECTOR             3       //001BH
#define     UART1_VECTOR            4       //0023H
#define     ADC_VECTOR              5       //002BH
#define     LVD_VECTOR              6       //0033H
#define     PCA_VECTOR              7       //003BH
#define     UART2_VECTOR            8       //0043H
#define     SPI_VECTOR              9       //004BH
#define     INT2_VECTOR             10      //0053H
#define     INT3_VECTOR             11      //005BH
#define     TMR2_VECTOR             12      //0063H
#define     USER_VECTOR             13      //006BH
#define     INT4_VECTOR             16      //0083H

/////////////////////////////////////////////////

#define NOP1()  _nop_()
#define NOP2()  NOP1(), NOP1()
#define NOP3()  NOP2(), NOP1()
#define NOP4()  NOP3(), NOP1()
#define NOP5()  NOP4(), NOP1()
#define NOP6()  NOP5(), NOP1()
#define NOP7()  NOP6(), NOP1()
#define NOP8()  NOP7(), NOP1()
#define NOP9()  NOP8(), NOP1()
#define NOP10() NOP9(), NOP1()
#define NOP11() NOP10(), NOP1()
#define NOP12() NOP11(), NOP1()
#define NOP13() NOP12(), NOP1()
#define NOP14() NOP13(), NOP1()
#define NOP15() NOP14(), NOP1()
#define NOP16() NOP15(), NOP1()
#define NOP17() NOP16(), NOP1()
#define NOP18() NOP17(), NOP1()
#define NOP19() NOP18(), NOP1()
#define NOP20() NOP19(), NOP1()
#define NOP21() NOP20(), NOP1()
#define NOP22() NOP21(), NOP1()
#define NOP23() NOP22(), NOP1()
#define NOP24() NOP23(), NOP1()
#define NOP25() NOP24(), NOP1()
#define NOP26() NOP25(), NOP1()
#define NOP27() NOP26(), NOP1()
#define NOP28() NOP27(), NOP1()
#define NOP29() NOP28(), NOP1()
#define NOP30() NOP29(), NOP1()
#define NOP31() NOP30(), NOP1()
#define NOP32() NOP31(), NOP1()
#define NOP33() NOP32(), NOP1()
#define NOP34() NOP33(), NOP1()
#define NOP35() NOP34(), NOP1()
#define NOP36() NOP35(), NOP1()
#define NOP37() NOP36(), NOP1()
#define NOP38() NOP37(), NOP1()
#define NOP39() NOP38(), NOP1()
#define NOP40() NOP39(), NOP1()
#define NOP( N )  NOP##N()

/////////////////////////////////////////////////

#endif

